var cities = new Array();
cities[0] = new Array("Благоевград", "Гоце Делчев", "Петрич", "Разлог", "Сандански", "Банско", "Якоруда", "Белица", "Гърмен", "Кресна", "Сатовча", "Симитли", "Хаджидимово", "Струмяни");
cities[1] = new Array("Бургас", "Айтос", "Карнобат", "Поморие", "Несебър", "Средец", "Камено", "Малко Търново", "Приморско", "Сунгурларе", "Царево", "Созопол");
cities[2] = new Array("Варна", "Белослав", "Бяла", "Девня", "Дългопол", "Долни чифлик", "Провадия", "Суворово", "Вълчи дол", "Аксаково", "Ветрино");
cities[3] = new Array("Велико Търново", "Свищов", "Горна Оряховица", "Елена", "Златарица", "Лясковец", "Павликени", "Полски Тръмбеш", "Стражица");
cities[4] = new Array("Видин", "Димово", "Бойница", "Макреш", "Ружинци", "Чупрене", "Белоградчик", "Брегово", "Грамада", "Кула", "Ново село");
cities[5] = new Array("Враца", "Мездра", "Мизия", "Борован", "Б. Слатина", "Козлодуй", "Оряхово", "Криводол", "Роман", "Хайредин");
cities[6] = new Array("Габрово", "Дряново", "Севлиево", "Трявна");
cities[7] = new Array("Добрич", "Албена", "Балчик", "Генерал Тошево", "Шабла", "Каварна", "Тервел", "Крушари");
cities[8] = new Array("Кърджали", "Момчилград", "Джебел", "Кирково", "Крумовград", "Ардино", "Черноочене");
cities[9] = new Array("Кюстендил", "Дупница", "Бобовдол", "Бобошево", "Невестино", "Сапарева баня", "Кочериново", "Рила");
cities[10] = new Array("Ловеч", "Априлци", "Луковит", "Троян", "Тетевен", "Летница", "Угърчин", "Ябланица");
cities[11] = new Array("Монтана", "Берковица", "Лом", "Вълчедръм", "Вършец", "Чипровци", "Бойчиновци", "Брусарци", "Якимово");
cities[12] = new Array("Пазарджик", "Велинград", "Панагюрище", "Пещера", "Ракитово", "Брацигово", "Септември", "Батак", "Белово", "Стрелча", "Лесичово");
cities[13] = new Array("Перник", "Радомир", "Брезник", "Трън", "Земен");
cities[14] = new Array("Плевен", "Белене", "Кнежа", "Левски", "Червен бряг", "Д. Дъбник", "Пордим", "Гулянци", "Д. Митрополия", "Искър", "Никопол");
cities[15] = new Array("Пловдив", "Асеновград", "Карлово", "Перущица", "Първомай", "Раковски", "Садово", "Стамболийски", "Хисар", "Сопот", "Брезово", "Кричим", "Лъки", "Съединение", "Калофер", "Клисура", "Калояново", "Куклен", "Родопи", "Марица");
cities[16] = new Array("Разград", "Исперих", "Кубрат", "Завет", "Лозница", "Цар Калоян");
cities[17] = new Array("Русе", "Бяла", "Ценово", "Две могили", "Борово", "Сливо поле", "Ветово", "Иваново");
cities[18] = new Array("Силистра", "Алфатар", "Дулово", "Ситово", "Кайнарджа", "Главиница", "Тутракан");
cities[19] = new Array("Сливен", "Нова Загора", "Котел", "Твърдица");
cities[20] = new Array("Смолян", "Девин", "Доспат", "Златоград", "Мадан", "Неделино", "Рудозем", "Чепеларе", "Баните", "Борино");
cities[21] = new Array("София - всички", "Банкя", "Витоша", "Връбница", "Възраждане", "Изгрев", "Илинден", "Искър", "Красна поляна", "Красно село", "Кремиковци", "Лозенец", "Люлин", "Младост", "Надежда", "Нови Искър", "Оборище", "Овча купел", "Панчарево", "Подуяне", "Сердика", "Слатина", "Средец", "Триадица", "Студентска");
cities[22] = new Array("Своге", "Антон", "Ботевград", "Елин Пелин", "Етрополе", "Златица", "Ихтиман", "Костенец", "Костинброд", "Мирково", "Правец", "Самоков", "Чавдар", "Челопеч", "Пирдоп", "Сливница", "Долна баня", "Божурище", "Годеч", "Горна малина", "Драгоман", "Копривщица", "Трудовец");
cities[23] = new Array("Стара Загора", "Казанлък", "Братя Даскалови", "Мъглиж", "Николаево", "Опан", "Чирпан", "Гълъбово", "Павел баня", "Раднево", "Гурково");
cities[24] = new Array("Търговище", "Омуртаг", "Попово", "Антоново", "Опака");
cities[25] = new Array("Хасково", "Димитровград", "Минерални бани", "Свиленград", "Симеоновград", "Харманли", "Ивайловград", "Любимец", "Маджарово", "Стамболово", "Тополовград");
cities[26] = new Array("Шумен", "Велики Преслав", "Каолиново", "Нови Пазар", "Каспичан", "Върбица", "Смядово", "Венец", "Хитрино");
cities[27] = new Array("Ямбол", "Елхово", "Стралджа", "Болярово", "Тунджа");

var a, c;

function fillCities() {
	a = $('area');
	c = $('city');
	var area = a.selectedIndex;
	c.options.length = 0;
	if (area > 0) {
		area--;
		$R(0, cities[area].length-1, 0).each(function(i) {
			c.options[i] = new Option(cities[area][i]);
		});
	} else {
		c.options[0] = new Option("\-\-","");
	}
	getTheSchools();
}

var url = domain + 'js/getSchools.php' ;

function getTheSchools() {
	a = $('area');
	c = $('city');
	new Ajax.Request(url,{
		method:'get',
		parameters: {location: c.options[c.selectedIndex].innerHTML.toString()},
		onSuccess: function(transport) {
			var response = transport.responseText || "Празен резултат!";
			var schools = new Array();
			schools = response.split('\n');
			$('schoolList').options.length = 1;
			$R(0,schools.length-2,0).each(function(i) {
				var currSchool = schools[i].split('!', 2);
				$('schoolList').options[i] = new Option(currSchool[1]);
				$('schoolList').options[i].value = currSchool[0];
			});
		},
		onFailure: function(transport) { 
			alert('Проблем с AJAX модаула... \n' + transport.getAllHeaders());
		}
	});
}

function ask() {
	return confirm("Сигурни ли сте, че искате да изтриете избрания елемент?\n ВНИМАНИЕ!!! Веднъж изтрит елементът не може да бъде възстановен!!!");
}


